_posts/2017-08-31-编写xposed模块hook多dex的apk.html
---
date: 2017-08-31 22:55
author: tiankai
layout: post
title: 编写Xposed模块Hook多dex的APK
excerpt: xposed hook multi dex
tags: 
categories: 
- Android
---

<div id="outline-container-org765b344" class="outline-2">
<h2 id="org765b344">编写Xposed模块Hook多Dex的apk</h2>
<div class="outline-text-2" id="text-org765b344">
<p>
最近在研究使用Xposed去Hook一个apk,但是在Hook的过程中发现,无论如何都不能hook成功.经过进一步对该APK进行研究发现,我需要的对象在第二个dex文件中. Xposed是默认没有办法处理多Dex的情况的. 所以hook多个dex文件的代码需要自己去实现.经过查找资料之后发现有办法可以解决多dex的hook的问题.关键部分的代码如下:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">app</span>.<span style="color: #ECBE7B;">Application</span>;
<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">content</span>.<span style="color: #ECBE7B;">Context</span>;
<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">content</span>.<span style="color: #a9a1e1;">pm</span>.<span style="color: #ECBE7B;">ApplicationInfo</span>;

<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">de</span>.<span style="color: #a9a1e1;">robv</span>.<span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">xposed</span>.<span style="color: #ECBE7B;">IXposedHookLoadPackage</span>;
<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">de</span>.<span style="color: #a9a1e1;">robv</span>.<span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">xposed</span>.<span style="color: #ECBE7B;">XC_MethodHook</span>;
<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">de</span>.<span style="color: #a9a1e1;">robv</span>.<span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">xposed</span>.<span style="color: #ECBE7B;">XposedBridge</span>;
<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">de</span>.<span style="color: #a9a1e1;">robv</span>.<span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">xposed</span>.<span style="color: #ECBE7B;">XposedHelpers</span>;
<span style="color: #51afef;">import</span> <span style="color: #a9a1e1;">de</span>.<span style="color: #a9a1e1;">robv</span>.<span style="color: #a9a1e1;">android</span>.<span style="color: #a9a1e1;">xposed</span>.<span style="color: #a9a1e1;">callbacks</span>.<span style="color: #a9a1e1;">XC_LoadPackage</span>.<span style="color: #ECBE7B;">LoadPackageParam</span>;

<span style="color: #7d7d7d;">/**</span>
<span style="color: #7d7d7d;"> * Created by tiankai on 17-8-23.</span>
<span style="color: #7d7d7d;"> */</span>

<span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">HookVerifyCode</span> <span style="color: #51afef;">implements</span> <span style="color: #ECBE7B;">IXposedHookLoadPackage</span> <span style="color: #51afef;">{</span>

    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">class_name</span> = <span style="color: #99bb66;">"the class name "</span>;
    <span style="color: #51afef;">public</span> <span style="color: #51afef;">static</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">phone_number</span> = <span style="color: #99bb66;">""</span>;      <span style="color: #525252;">// </span><span style="color: #525252;">this argument is a global</span>
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">PACKAGENAME</span> = <span style="color: #99bb66;">"com.test.hookmoule"</span>;
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">XPOSEDINSTALLER</span> = <span style="color: #99bb66;">"de.robv.android.xposed.installer"</span>;
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">SMSPACKAGENAME</span> = <span style="color: #99bb66;">"com.google.android.talk"</span>;
    <span style="color: #51afef;">private</span> <span style="color: #51afef;">static</span> <span style="color: #51afef;">final</span> <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">TARGETPACKAGENAME</span> = <span style="color: #99bb66;">"the target process name"</span>;


    <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">handleLoadPackage</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">LoadPackageParam</span> <span style="color: #dcaeea;">lpparam</span><span style="color: #c678dd;">)</span> <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">Throwable</span> <span style="color: #c678dd;">{</span>

        <span style="color: #51afef;">if</span> <span style="color: #99bb66;">(</span>lpparam.appInfo != <span style="color: #a9a1e1;">null</span> &amp;&amp; lpparam.isFirstApplication
                &amp;&amp; <span style="color: #51afef;">(</span>SMSPACKAGENAME.equals<span style="color: #c678dd;">(</span>lpparam.packageName<span style="color: #c678dd;">)</span> || OFOPACKAGENAME.equals<span style="color: #c678dd;">(</span>lpparam.packageName<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span><span style="color: #99bb66;">)</span> <span style="color: #99bb66;">{</span>
            <span style="color: #525252;">// </span><span style="color: #525252;">hook android.app.Application.attach method</span>
            XposedHelpers.findAndHookMethod<span style="color: #51afef;">(</span>Application.<span style="color: #51afef;">class</span>, <span style="color: #99bb66;">"attach"</span>, Context.<span style="color: #51afef;">class</span>, <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">XC_MethodHook</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
                <span style="color: #a9a1e1;">@Override</span>
                <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">beforeHookedMethod</span><span style="color: #99bb66;">(</span><span style="color: #ECBE7B;">MethodHookParam</span> <span style="color: #dcaeea;">param</span><span style="color: #99bb66;">)</span> <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">Throwable</span> <span style="color: #99bb66;">{</span>
                     <span style="color: #525252;">// </span><span style="color: #525252;">this will be called before the clock was updated by the original method</span>
                <span style="color: #99bb66;">}</span>

                <span style="color: #a9a1e1;">@Override</span>
                <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">afterHookedMethod</span><span style="color: #99bb66;">(</span><span style="color: #a9a1e1;">XC_MethodHook</span>.<span style="color: #ECBE7B;">MethodHookParam</span> <span style="color: #dcaeea;">param</span><span style="color: #99bb66;">)</span> <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">Throwable</span> <span style="color: #99bb66;">{</span>
                    <span style="color: #ECBE7B;">ClassLoader</span> <span style="color: #dcaeea;">cl</span> = <span style="color: #51afef;">(</span><span style="color: #c678dd;">(</span><span style="color: #ECBE7B;">Context</span><span style="color: #c678dd;">)</span> param.args<span style="color: #c678dd;">[</span><span style="color: #dd8844; font-weight: bold;">0</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>.getClassLoader<span style="color: #51afef;">()</span>;
                    <span style="color: #ECBE7B;">Class</span><span style="color: #51afef;">&lt;</span>?<span style="color: #51afef;">&gt;</span> <span style="color: #dcaeea;">hookclass</span> = <span style="color: #a9a1e1;">null</span>;
                    <span style="color: #51afef;">try</span> <span style="color: #51afef;">{</span>
                        hookclass = cl.loadClass<span style="color: #c678dd;">(</span>class_name<span style="color: #c678dd;">)</span>;
                    <span style="color: #51afef;">}</span> <span style="color: #51afef;">catch</span> <span style="color: #51afef;">(</span><span style="color: #ECBE7B;">Exception</span> <span style="color: #dcaeea;">e</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
                        Logger.log<span style="color: #c678dd;">(</span><span style="color: #99bb66;">"[Failed!]Can not find "</span> + class_name<span style="color: #c678dd;">)</span>;
                        <span style="color: #51afef;">return</span>;
                    <span style="color: #51afef;">}</span>
                    Logger.log<span style="color: #51afef;">(</span><span style="color: #99bb66;">"[success!]Find class "</span> + class_name<span style="color: #51afef;">)</span>;

                    XposedHelpers.findAndHookMethod<span style="color: #51afef;">(</span>hookclass,
                            <span style="color: #99bb66;">"getVerifyCode"</span>, <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">XC_MethodHook</span><span style="color: #c678dd;">()</span> <span style="color: #c678dd;">{</span>
                                <span style="color: #a9a1e1;">@Override</span>
                                <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">beforeHookedMethod</span><span style="color: #99bb66;">(</span><span style="color: #ECBE7B;">MethodHookParam</span> <span style="color: #dcaeea;">param</span><span style="color: #99bb66;">)</span> <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">Throwable</span> <span style="color: #99bb66;">{</span>
                                    <span style="color: #525252;">// </span><span style="color: #525252;">this will be called before the clock was updated by the original method</span>
                                <span style="color: #99bb66;">}</span>

                                <span style="color: #a9a1e1;">@Override</span>
                                <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">afterHookedMethod</span><span style="color: #99bb66;">(</span><span style="color: #ECBE7B;">MethodHookParam</span> <span style="color: #dcaeea;">param</span><span style="color: #99bb66;">)</span> <span style="color: #51afef;">throws</span> <span style="color: #ECBE7B;">Throwable</span> <span style="color: #99bb66;">{</span>
                                    <span style="color: #525252;">// </span><span style="color: #525252;">this will be called after the clock was updated by the original method</span>
                                    <span style="color: #ECBE7B;">String</span> <span style="color: #dcaeea;">verify_code</span> = param.getResult<span style="color: #51afef;">()</span>.toString<span style="color: #51afef;">()</span>;
                                    <span style="color: #51afef;">if</span> <span style="color: #51afef;">(</span>verify_code.length<span style="color: #c678dd;">()</span> == <span style="color: #dd8844; font-weight: bold;">4</span><span style="color: #51afef;">)</span> <span style="color: #51afef;">{</span>
                                        Logger.log<span style="color: #c678dd;">(</span><span style="color: #99bb66;">"the verify code:"</span> + verify_code<span style="color: #c678dd;">)</span>;
                                        Logger.log<span style="color: #c678dd;">(</span><span style="color: #99bb66;">"the final phone number: "</span> + HookManager.phone_number<span style="color: #c678dd;">)</span>;
                                    <span style="color: #51afef;">}</span>
                                <span style="color: #99bb66;">}</span>
                            <span style="color: #c678dd;">}</span><span style="color: #51afef;">)</span>;
                <span style="color: #99bb66;">}</span>
            <span style="color: #c678dd;">}</span><span style="color: #51afef;">)</span>;  <span style="color: #525252;">// </span><span style="color: #525252;">end of findAndHookMethod</span>
        <span style="color: #99bb66;">}</span> <span style="color: #525252;">// </span><span style="color: #525252;">end of if </span>
    <span style="color: #c678dd;">}</span>  <span style="color: #525252;">// </span><span style="color: #525252;">end of handlePackage</span>
<span style="color: #51afef;">}</span> <span style="color: #525252;">// </span><span style="color: #525252;">end of class</span>
</pre>
</div>
</div>
</div>
